/**
 *   Copyright (C) 2015 by Ericsson AB. All rights reserved. The
 *   information in this document is the property of Ericsson. Except
 *   as specifically authorized in writing by Ericsson, the receiver
 *   of this document shall keep the information contained herein
 *   confidential and shall protect the same in whole or in part from
 *   disclosure and dissemination to third parties. Disclosure and
 *   disseminations to the receiver's employees shall only be made on
 *   a strict need to know basis.
 */
#include <errno.h>
#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include <unistd.h>
#include <stdbool.h>
#include <string.h>
#include <sys/types.h>
#include <pthread.h>

#include <itc.h>
#include <getopt.h>
#include <uio_helper.h>
#include <semaphore.h>

#include "libspi.h"

#define TRACEPOINT_PROVIDER     com_ericsson_xcs_rhd_libspi
#include "tpt_create.h"
#include "tpt.h"
/*
 * SPI clock rate (CTRL RATE).
 * SPI clock rate = 245.72 MHz / (2* (CTRL_RATE +1))
 */
#define CTRL_RATE_MASK     0x3fff0000
#define CTRL_RATE_POS      16

/*
 * SPI Clock idle (CTRL CLK_IDLE).
 * Half Clock Cycles Idle Time First and Last bit and in Bidir Shift Phase
 * 0 One half cycle
 * 1 Two half cycle
*/
#define CTRL_CLK_IDLE_MASK 0x00001000
#define CTRL_CLK_IDLE_POS  12

/*
 * SPI Slave Select (CTRL SS).
 * This bit sets the Slave Select signal if the CTRL_SS_MODE is set to
 * manual.
 * 0 Slave Select is inactive (low)
 * 1 Slave Select is active (high)
 */

#define CTRL_SS_BIDIR_POS  8

/*
 * Slave Select mode (CTRL SS_MODE).
 * 0 No automatic Slave Select generation
 * 1 Automatic Slave Select generation
 */
#define CTRL_SS_MODE_MASK  0x0000080
#define CTRL_SS_MODE_POS   7

/*
 * SPI Enable (CTRL EN).
 * 0 SPI communication is disabled
 * 1 SPI communication is enabled
 */
#define CTRL_EN_MASK       0x0000020
#define CTRL_EN_POS        5

/*
 * LSB First Enable (CTRL LSBFE).
 * 0 Send each 32 bits word with MSB bit first
 * 1 Send each 32 bits word with LSB bit first
 */
#define CTRL_LSBFE_MASK    0x0000010
#define CTRL_LSBFE_POS     4

/*
 * SPI Clock Phase bit (CTRL CPHA).
 * 0 Sampling on leading edges
 * 1 Sampling on trailing edges
 */
#define CTRL_CPHA_MASK     0x00000008
#define CTRL_CPHA_POS      3

/*
 * SPI Clock polarity bit (CTRL CPOL).
 * 0 In idle state spi_m_clk is low
 * 1 In idle state spi_m_clk is high
 */
#define CTRL_CPOL_MASK     0x00000004
#define CTRL_CPOL_POS      2

/*
 * SPI command mode (CTRL MODE).
 * 00 Write
 * 01 Read
 * 10 Bidir
 * 11 Duplex
 */
#define CTRL_MODE_MASK     0x00000003
#define CTRL_MODE_POS      0

/*
 * Select which SPI port to use (HUB PORT).
 * Range is 0 to 11.
 */
#define HUB_PORT_MAX      2
#define HUB_PORT_MASK     0x000000C0
#define HUB_PORT_POS      6

/*
 * Selects if 3 or 4 wire communication to slave (HUB 4W).
 * 0 = 3-wire SPI.
 * 1 = 4-wire SPI.
 */
#define HUB_4W_MASK     0x00000004
#define HUB_4W_POS      2

/*
 * Selects if spi clock should be inverted (HUB CLK_INV).
 * 0 = SPI_CLK is unchanged.
 * 1 = Invert  SPI_CLK.
 */
#define HUB_CLK_INV_MASK     0x00000002
#define HUB_CLK_INV_POS      1

/*
 * Selects if slave select should be inverted (HUB SS_HIGH).
 * 0 = Slave Select is active low
 * 1 = Slave Select is active high
 */
#define HUB_SS_HIGH_MASK     0x00000001
#define HUB_SS_HIGH_POS      0

/* SPI_LENGTH, bit positions in register. */
#define LENGTH_DIR_POS       16 /* SPI length until direction shift    */
/* (0 - 255). Only used in bidir mode. */
/* Number of bits  is DIR+1            */
#define LENGTH_VAL_POS       0  /* SPI transfer length (0 - 255).      */
/* Number of bits is VAL+1             */

/* CMD */
#define CMD_RESET            0x2   /* Reset SPI controller. */
#define CMD_STRB             0x1   /* Start transfer. */

/* SPI_STATUS */
#define STATUS_ACT           0x80 /* An SPI command is processed.      */
#define STATUS_RX_OR         0x40 /* RX Overrun flag.                  */
#define STATUS_RX_AVAIL      0x20 /* Data is available in the RX fifo. */
#define STATUS_RX_FULL       0x10 /* RX fifo is full.                  */
#define STATUS_TX_UR         0x08 /* TX underrun flag.                 */
#define STATUS_TX_FULL       0x04 /* TX fifo is full.                  */
#define STATUS_TX_EMPTY      0x02 /* TX fifo is empty.                 */
#define STATUS_DONE          0x01 /* An SPI command is done.           */

#define LENGTH_VAL_MAX       256  /* Maximum number of bits in one burst. */

/* Pointers to SPI registers */
struct spi_reg {
	uint32_t ctrl;        /* 0x00 */
	uint32_t length;      /* 0x04 */
	uint32_t tx;          /* 0x08 */
	uint32_t rx;          /* 0x0C */
	uint32_t cmd;         /* 0x10 */
	uint32_t status;      /* 0x14 */
	uint32_t status_trap;  /* 0x18 */
	uint32_t status_mask;  /* 0x1C */
	uint32_t status_force; /* 0x20 */
	uint32_t status_debug; /* 0x24 */
	uint32_t status_trig;  /* 0x28 */
	uint32_t space[9];    /* 0x2C-0x4C */
	uint32_t hubSs;       /* 0x50 */
	uint32_t hub[16];     /* 0x54-0xC8 */
};

struct spi_dev {
	uint32_t unit;
	bool         in_use;
	uint32_t     ctrl_reg; /* Units copy of CTRL register*/
	struct spi_master *master;
};

struct spi_master {
	struct {
		/* Transmitting unit.  */
		uint32_t unit;
		/* Indicates if error occurred. */
		uint32_t err;
		struct {
			/* Number of elements in vector.*/
			uint32_t count;
			/* Pointer to array of buffers and buffer lengths. */
			const struct spi_buffer_des *vector;
			/* current index in vector array.*/
			uint32_t index;
			/* Pointer to transmitted byte in
			   vector[index].base_addr.*/
			uint8_t *buffer;
			/* Number of bytes left to process in
			   vector[index].base_addr.*/
			uint32_t length;

		} iov;

		struct {
			/* Number of bits in this write operation   */
			uint32_t num_bits;
			/* Number of bits left to write*/
			uint32_t num_bits_left;
			struct {
				uint32_t count;
				const struct spi_buffer_des *vector;
				uint32_t index;

			} iov;
		} wr;

